Repository: fangjunyu1/SwiftSlim
Catalog: SwiftSlim/Localization/Localizable.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, fi, fr, gu, he, hi, hr, hu, id, it, ja, kk, kn, ko, lt, ml, mr, ms, nb, nl, or, pa, pl, pt, ro, ru, sk, sl, sv, ta, te, th, tr, uk, ur, vi, zh_hans, zh_hant

source: Shows multiple actions.
ar: يعرض عدة إجراءات.
bg: Показва няколко действия.
bn: একাধিক অ্যাকশন দেখায়।
ca: Mostra diverses accions.
cs: Zobrazuje více akcí.
da: Viser flere handlinger.
de: Zeigt mehrere Aktionen.
el: Εμφανίζει πολλές ενέργειες.
es: Muestra varias acciones.
fi: Näyttää useita toimintoja.
fr: Affiche plusieurs actions.
gu: ઘણી ક્રિયાઓ બતાવે છે.
he: מציג כמה פעולות.
hi: कई कार्रवाइयाँ दिखाता है।
hr: Prikazuje više radnji.
hu: Több műveletet jelenít meg.
id: Menampilkan beberapa aksi.
it: Mostra più azioni.
ja: 複数のアクションを表示します。
kk: Бірнеше әрекетті көрсетеді.
kn: ಹಲವು ಕ್ರಿಯೆಗಳನ್ನು ತೋರಿಸುತ್ತದೆ.
ko: 여러 동작을 표시합니다.
lt: Rodo kelis veiksmus.
ml: ഒന്നിലധികം പ്രവർത്തനങ്ങൾ കാണിക്കുന്നു.
mr: अनेक क्रिया दाखवतो.
ms: Memaparkan beberapa tindakan.
nb: Viser flere handlinger.
nl: Toont meerdere acties.
or: ଅନେକ କାର୍ଯ୍ୟ ଦେଖାଏ।
pa: ਕਈ ਕਾਰਵਾਈਆਂ ਦਿਖਾਉਂਦਾ ਹੈ।
pl: Pokazuje wiele akcji.
pt: Mostra várias ações.
ro: Afișează mai multe acțiuni.
ru: Показывает несколько действий.
sk: Zobrazuje viac akcií.
sl: Prikaže več dejanj.
sv: Visar flera åtgärder.
ta: பல செயல்களை காட்டும்.
te: అనేక చర్యలను చూపిస్తుంది.
th: แสดงหลายการกระทำ
tr: Birden çok eylem gösterir.
uk: Показує кілька дій.
ur: متعدد اعمال دکھاتا ہے۔
vi: Hiển thị nhiều hành động.
zh_hans: 用于展示多个可选操作。
zh_hant: 用於顯示多個可選操作。

source: Shows scrollable content.
ar: يعرض محتوى قابلًا للتمرير.
bg: Показва превъртащо се съдържание.
bn: স্ক্রলযোগ্য কনটেন্ট দেখায়।
ca: Mostra contingut desplaçable.
cs: Zobrazuje posuvný obsah.
da: Viser indhold, der kan rulles.
de: Zeigt scrollbaren Inhalt.
el: Εμφανίζει περιεχόμενο με κύλιση.
es: Muestra contenido desplazable.
fi: Näyttää vieritettävää sisältöä.
fr: Affiche du contenu défilable.
gu: સ્ક્રોલ કરી શકાય તેવી સામગ્રી બતાવે છે.
he: מציג תוכן שניתן לגלול.
hi: स्क्रॉल होने वाली सामग्री दिखाता है।
hr: Prikazuje sadržaj koji se može pomicati.
hu: Görgethető tartalmat jelenít meg.
id: Menampilkan konten yang dapat digulir.
it: Mostra contenuto scorrevole.
ja: スクロール可能な内容を表示します。
kk: Айналдыруға болатын мазмұнды көрсетеді.
kn: ಸ್ಕ್ರೋಲ್ ಮಾಡಬಹುದಾದ ವಿಷಯವನ್ನು ತೋರಿಸುತ್ತದೆ.
ko: 스크롤 가능한 콘텐츠를 표시합니다.
lt: Rodo slenkamą turinį.
ml: സ്ക്രോൾ ചെയ്യാവുന്ന ഉള്ളടക്കം കാണിക്കുന്നു.
mr: स्क्रोल करता येणारी सामग्री दाखवतो.
ms: Memaparkan kandungan boleh tatal.
nb: Viser rullbart innhold.
nl: Toont scrollbare inhoud.
or: ସ୍କ୍ରୋଲ୍ ହେବାଯୋଗ୍ୟ ବିଷୟବସ୍ତୁ ଦେଖାଏ।
pa: ਸਕ੍ਰੋਲ ਹੋਣ ਵਾਲੀ ਸਮੱਗਰੀ ਦਿਖਾਉਂਦਾ ਹੈ।
pl: Pokazuje przewijaną zawartość.
pt: Mostra conteúdo rolável.
ro: Afișează conținut derulabil.
ru: Показывает прокручиваемое содержимое.
sk: Zobrazuje posúvateľný obsah.
sl: Prikaže vsebino za pomikanje.
sv: Visar rullningsbart innehåll.
ta: ஸ்க்ரோல் செய்யக்கூடிய உள்ளடக்கத்தை காட்டும்.
te: స్క్రోల్ చేయగల కంటెంట్‌ను చూపిస్తుంది.
th: แสดงเนื้อหาที่เลื่อนได้
tr: Kaydırılabilir içerik gösterir.
uk: Показує прокручуваний вміст.
ur: اسکرول ہونے والا مواد دکھاتا ہے۔
vi: Hiển thị nội dung có thể cuộn.
zh_hans: 用于展示可滚动内容。
zh_hant: 用於顯示可捲動內容。

source: Sign In View
ar: واجهة تسجيل الدخول
bg: Изглед за вход
bn: সাইন-ইন ভিউ
ca: Vista d'inici de sessió
cs: Zobrazení přihlášení
da: Loginvisning
de: Anmeldeansicht
el: Προβολή σύνδεσης
es: Vista de inicio de sesión
fi: Kirjautumisnäkymä
fr: Vue de connexion
gu: સાઇન-ઇન વ્યૂ
he: תצוגת התחברות
hi: साइन-इन व्यू
hr: Prikaz prijave
hu: Bejelentkezési nézet
id: Tampilan Sign In
it: Vista di accesso
ja: サインインビュー
kk: Кіру көрінісі
kn: ಸೈನ್ ಇನ್ ವ್ಯೂ
ko: 로그인 뷰
lt: Prisijungimo vaizdas
ml: സൈൻ ഇൻ വ്യൂ
mr: साइन-इन व्ह्यू
ms: Paparan Sign In
nb: Innloggingsvisning
nl: Inlogweergave
or: ସାଇନ୍-ଇନ୍ ଭ୍ୟୁ
pa: ਸਾਈਨ ਇਨ ਦ੍ਰਿਸ਼
pl: Widok logowania
pt: Visão de login
ro: Vizualizare de autentificare
ru: Экран входа
sk: Zobrazenie prihlásenia
sl: Pogled za prijavo
sv: Inloggningsvy
ta: உள்நுழைவு காட்சி
te: సైన్ ఇన్ దృశ్యం
th: มุมมองการลงชื่อเข้าใช้
tr: Oturum Açma Görünümü
uk: Екран входу
ur: سائن اِن منظر
vi: Giao diện đăng nhập
zh_hans: 登录视图
zh_hant: 登入視圖

source: Simulator and Physical Device
ar: المحاكي والجهاز الحقيقي
bg: Симулатор и физическо устройство
bn: সিমুলেটর এবং ফিজিক্যাল ডিভাইস
ca: Simulador i dispositiu físic
cs: Simulátor a fyzické zařízení
da: Simulator og fysisk enhed
de: Simulator und physisches Gerät
el: Προσομοιωτής και πραγματική συσκευή
es: Simulador y Dispositivo Físico
fi: Simulaattori ja fyysinen laite
fr: Simulateur et appareil physique
gu: સિમ્યુલેટર અને ભૌતિક ઉપકરણ
he: סימולטור ומכשיר פיזי
hi: सिमुलेटर और भौतिक डिवाइस
hr: Simulator i fizički uređaj
hu: Szimulátor és fizikai eszköz
id: Simulator dan Perangkat Fisik
it: Simulatore e dispositivo fisico
ja: シミュレーターと実機デバイス
kk: Симулятор және физикалық құрылғы
kn: ಸಿಮ್ಯುಲೇಟರ್ ಮತ್ತು ಭೌತಿಕ ಸಾಧನ
ko: 시뮬레이터 및 실제 기기
lt: Simuliatorius ir fizinis įrenginys
ml: സിമുലേറ്ററും ഭൗതിക ഉപകരണവും
mr: सिम्युलेटर आणि भौतिक उपकरण
ms: Simulator dan Peranti Fizikal
nb: Simulator og fysisk enhet
nl: Simulator en fysiek apparaat
or: ସିମ୍ୟୁଲେଟର ଏବଂ ଭୌତିକ ଉପକରଣ
pa: ਸਿਮੂਲੇਟਰ ਅਤੇ ਭੌਤਿਕ ਡਿਵਾਈਸ
pl: Symulator i urządzenie fizyczne
pt: Simulador e Dispositivo Físico
ro: Simulator și dispozitiv fizic
ru: Симулятор и физическое устройство
sk: Simulátor a fyzické zariadenie
sl: Simulator in fizična naprava
sv: Simulator och fysisk enhet
ta: சிமுலேட்டர் மற்றும் இயற்பியல் சாதனம்
te: సిమ్యులేటర్ మరియు భౌతిక పరికరం
th: ตัวจำลองและอุปกรณ์จริง
tr: Simülatör ve Fiziksel Cihaz
uk: Симулятор і фізичний пристрій
ur: سیمیولیٹر اور فزیکل ڈیوائس
vi: Trình giả lập và Thiết bị Vật lý
zh_hans: 模拟器与实体设备
zh_hant: 模擬器與實體裝置

source: Skip
ar: تخطي
bg: Пропускане
bn: এড়িয়ে যান
ca: Omet
cs: Přeskočit
da: Spring over
de: Überspringen
el: Παράλειψη
es: Omitir
fi: Ohita
fr: Passer
gu: છોડો
he: דלג
hi: छोड़ें
hr: Preskoči
hu: Kihagyás
id: Lewati
it: Salta
ja: スキップ
kk: Өткізіп жіберу
kn: ಬಿಟ್ಟುಬಿಡಿ
ko: 건너뛰기
lt: Praleisti
ml: ഒഴിവാക്കുക
mr: वगळा
ms: Langkau
nb: Hopp over
nl: Overslaan
or: ଛାଡନ୍ତୁ
pa: ਛੱਡੋ
pl: Pomiń
pt: Ignorar
ro: Omite
ru: Пропустить
sk: Preskočiť
sl: Preskoči
sv: Hoppa över
ta: தவிர்
te: దాటవేయి
th: ข้าม
tr: Atla
uk: Пропустити
ur: چھوڑیں
vi: Bỏ qua
zh_hans: 跳过
zh_hant: 跳過

source: Start from ContentView
ar: البدء من ContentView
bg: Започваме от ContentView
bn: ContentView থেকে শুরু
ca: Començar des de ContentView
cs: Začínáme s ContentView
da: Start med ContentView
de: Start mit ContentView
el: Ξεκινώντας από το ContentView
es: Comienza desde ContentView
fi: Aloita ContentView’stä
fr: Commencer avec ContentView
gu: ContentView થી શરૂઆત કરો
he: התחל מ-ContentView
hi: ContentView से शुरुआत करें
hr: Započnite od ContentView
hu: Kezdje a ContentView-vel
id: Mulai dari ContentView
it: Inizia da ContentView
ja: ContentView から始める
kk: ContentView-тен бастаңыз
kn: ContentView ಇಂದ ಪ್ರಾರಂಭಿಸಿ
ko: ContentView부터 시작하기
lt: Pradėkite nuo ContentView
ml: ContentView ൽ നിന്ന് ആരംഭിക്കുക
mr: ContentView पासून सुरुवात करा
ms: Mulakan dari ContentView
nb: Start fra ContentView
nl: Begin bij ContentView
or: ContentView ଠାରୁ ଆରମ୍ଭ କରନ୍ତୁ
pa: ContentView ਤੋਂ ਸ਼ੁਰੂ ਕਰੋ
pl: Zacznij od ContentView
pt: Comece pelo ContentView
ro: Începeți de la ContentView
ru: Начните с ContentView
sk: Začnite od ContentView
sl: Začnite z ContentView
sv: Börja från ContentView
ta: ContentView இலிருந்து தொடங்குங்கள்
te: ContentView నుండి ప్రారంభించండి
th: เริ่มต้นจาก ContentView
tr: ContentView’den başlayın
uk: Почніть з ContentView
ur: ContentView سے شروع کریں
vi: Bắt đầu từ ContentView
zh_hans: 从 ContentView 开始
zh_hant: 從 ContentView 開始

source: Start from zero with SwiftUI and systematically learn Apple’s declarative UI development. Through clear explanations and practical examples, you will gradually master layout, interaction, and state management to build beautiful and useful app interfaces.
ar: "تعرّف على SwiftUI من الصفر وتعلّم منهجيًا تطوير الواجهات التصريحية من Apple. من خلال شرح واضح وأمثلة عملية، ستتمكن تدريجيًا من إتقان التخطيط والتفاعل وإدارة الحالة لبناء واجهات تطبيقات جميلة وعملية.
bg: Запознайте се със SwiftUI от нулата и усвоете систематично декларативната разработка на интерфейси на Apple. Чрез ясни обяснения и практически примери постепенно ще овладеете оформление, взаимодействия и управление на състоянието, за да изграждате красиви и полезни интерфейси.
bn: শূন্য থেকে SwiftUI শিখুন এবং Apple-এর declarative UI ডেভেলপমেন্ট পদ্ধতি ধারাবাহিকভাবে আয়ত্ত করুন। সহজ ব্যাখ্যা ও বাস্তব উদাহরণের মাধ্যমে আপনি ধীরে ধীরে layout, interaction এবং state management শিখে সুন্দর ও ব্যবহারিক অ্যাপ ইন্টারফেস তৈরি করতে পারবেন।
ca: Coneix SwiftUI des de zero i aprèn de manera sistemàtica el desenvolupament declaratiu d’interfícies d’Apple. Amb explicacions clares i exemples pràctics, aniràs dominant el disseny, la interacció i la gestió de l’estat per crear interfícies d’aplicació boniques i útils.
cs: Seznamte se se SwiftUI od nuly a systematicky se naučte deklarativní vývoj rozhraní od Applu. Díky srozumitelnému výkladu a praktickým příkladům si postupně osvojíte rozvržení, interakce i správu stavu a vytvoříte krásná a užitečná rozhraní aplikací.
da: Lær SwiftUI fra bunden, og få en systematisk introduktion til Apples deklarative UI-udvikling. Med klare forklaringer og praktiske eksempler lærer du gradvist layout, interaktion og state management, så du kan bygge flotte og nyttige app-grænseflader.
de: Lerne SwiftUI von Grund auf kennen und eigne dir systematisch Apples deklarative UI-Entwicklung an. Mit klaren Erklärungen und praxisnahen Beispielen lernst du Schritt für Schritt Layout, Interaktion und Zustandsverwaltung, um schöne und nützliche App-Oberflächen zu erstellen.
el: Γνώρισε το SwiftUI από το μηδέν και μάθε συστηματικά την δηλωτική ανάπτυξη διεπαφών της Apple. Με σαφείς εξηγήσεις και πρακτικά παραδείγματα, θα κατακτήσεις σταδιακά τη διάταξη, την αλληλεπίδραση και τη διαχείριση κατάστασης, δημιουργώντας όμορφες και χρήσιμες διεπαφές εφαρμογών.
es: Conoce SwiftUI desde cero y aprende de forma sistemática el desarrollo declarativo de interfaces de Apple. Con explicaciones claras y ejemplos prácticos, dominarás poco a poco el diseño, la interacción y la gestión del estado para crear interfaces de apps bonitas y útiles.
fi: Tutustu SwiftUIhin alusta alkaen ja opi järjestelmällisesti Applen deklaratiivista käyttöliittymäkehitystä. Selkeiden selitysten ja käytännön esimerkkien avulla hallitset vähitellen asettelun, vuorovaikutukset ja tilanhallinnan sekä rakennat kauniita ja hyödyllisiä sovellusliittymiä.
fr: Découvrez SwiftUI à partir de zéro et apprenez de façon structurée le développement déclaratif d’interfaces d’Apple. Grâce à des explications claires et à des exemples concrets, vous maîtriserez progressivement la mise en page, les interactions et la gestion d’état pour créer des interfaces belles et utiles.
gu: શરૂઆતથી SwiftUI ઓળખો અને Apple ની declarative interface development પદ્ધતિને વ્યવસ્થિત રીતે શીખો. સરળ સમજણ અને વાસ્તવિક ઉદાહરણોના અભ્યાસ દ્વારા તમે ધીમે ધીમે layout, interaction અને state management માં કુશળ બની સુંદર અને ઉપયોગી app interfaces બનાવી શકશો.
he: "הכירו את SwiftUI מהיסוד ולמדו בצורה מסודרת את פיתוח הממשקים ההצהרתי של Apple. בעזרת הסברים ברורים ותרגול על דוגמאות מעשיות, תלמדו בהדרגה פריסה, אינטראקציה וניהול מצב כדי לבנות ממשקי אפליקציה יפים ושימושיים.
hi: SwiftUI को शून्य से समझें और Apple के declarative UI development को व्यवस्थित रूप से सीखें। सरल व्याख्या और व्यावहारिक उदाहरणों के माध्यम से आप धीरे-धीरे layout, interaction और state management में महारत हासिल करेंगे और सुंदर व उपयोगी app interfaces बना सकेंगे।
hr: Upoznajte SwiftUI od samih osnova i sustavno učite Appleov deklarativni razvoj sučelja. Uz jasna objašnjenja i praktične primjere postupno ćete savladati raspored, interakcije i upravljanje stanjem te izraditi lijepa i korisna sučelja aplikacija.
hu: Ismerd meg a SwiftUI-t az alapoktól, és tanuld meg rendszeresen az Apple deklaratív felületfejlesztését. Közérthető magyarázatokkal és gyakorlati példákkal fokozatosan elsajátíthatod az elrendezést, az interakciót és az állapotkezelést, hogy szép és hasznos alkalmazásfelületeket építs.
id: Pelajari SwiftUI dari nol dan pahami secara sistematis pengembangan antarmuka deklaratif Apple. Dengan penjelasan yang jelas dan latihan melalui contoh nyata, Anda akan secara bertahap menguasai tata letak, interaksi, dan manajemen state untuk membangun antarmuka aplikasi yang indah dan berguna.
it: Scopri SwiftUI da zero e impara in modo sistematico lo sviluppo dichiarativo delle interfacce Apple. Grazie a spiegazioni chiare ed esempi pratici, padroneggerai gradualmente layout, interazione e gestione dello stato per creare interfacce app belle e utili.
ja: SwiftUI をゼロから学び、Apple の宣言型 UI 開発を体系的に身につけましょう。わかりやすい解説と実践的な例題を通して、レイアウト、インタラクション、状態管理を段階的に習得し、美しく実用的なアプリ画面を構築できます。
kk: SwiftUI-ді нөлден бастап танып, Apple-дің декларативті интерфейс әзірлеу тәсілін жүйелі түрде үйреніңіз. Түсінікті түсіндірмелер мен практикалық мысалдар арқылы сіз біртіндеп макеттеуді, өзара әрекеттесуді және күйді басқаруды меңгеріп, әдемі әрі пайдалы қосымша интерфейстерін жасай аласыз.
kn: SwiftUI ಅನ್ನು ಶೂನ್ಯದಿಂದ ತಿಳಿದುಕೊಳ್ಳಿ ಮತ್ತು Apple‌ನ declarative UI development ಅನ್ನು ಕ್ರಮಬದ್ಧವಾಗಿ ಕಲಿಯಿರಿ. ಸರಳ ಮತ್ತು ಸ್ಪಷ್ಟವಾದ ವಿವರಣೆಗಳು ಹಾಗೂ ಪ್ರಾಯೋಗಿಕ ಉದಾಹರಣೆಗಳ ಮೂಲಕ ನೀವು ಹಂತ ಹಂತವಾಗಿ layout, interaction ಮತ್ತು state management ಅನ್ನು ಅರ್ಥಮಾಡಿಕೊಂಡು ಸುಂದರ ಮತ್ತು ಉಪಯುಕ್ತ app interfaces ನಿರ್ಮಿಸಬಹುದು.
ko: SwiftUI를 처음부터 이해하고 Apple의 선언형 UI 개발을 체계적으로 배워 보세요. 쉽고 명확한 설명과 실제 예제 연습을 통해 레이아웃, 상호작용, 상태 관리를 차근차근 익히고, 아름답고 실용적인 앱 인터페이스를 만들 수 있습니다.
lt: Susipažinkite su SwiftUI nuo nulio ir nuosekliai mokykitės Apple deklaratyvaus sąsajų kūrimo. Aiškūs paaiškinimai ir praktiniai pavyzdžiai padės palaipsniui įvaldyti išdėstymą, sąveikas ir būsenos valdymą, kad galėtumėte kurti gražias ir naudingas programėlių sąsajas.
ml: പൂജ്യത്തിൽ നിന്ന് SwiftUIയെ പരിചയപ്പെടുകയും Appleന്റെ declarative UI development ക്രമബദ്ധമായി അഭ്യസിക്കുകയും ചെയ്യൂ. ലളിതവും വ്യക്തവുമായ വിശദീകരണങ്ങളും പ്രായോഗിക ഉദാഹരണങ്ങളും വഴി layout, interaction, state management എന്നിവ ക്രമേണ കൈവശപ്പെടുത്തി മനോഹരവും പ്രായോഗികവുമായ app interfaces നിർമ്മിക്കാൻ നിങ്ങളെ സഹായിക്കും.
mr: SwiftUI ची ओळख शून्यापासून करून घ्या आणि Apple च्या declarative UI development ची प्रणालीबद्ध पद्धतीने शिकवण घ्या. सोप्या स्पष्टीकरणांसह आणि प्रत्यक्ष उदाहरणांच्या सरावातून तुम्ही हळूहळू layout, interaction आणि state management मध्ये प्रावीण्य मिळवून सुंदर आणि उपयुक्त app interfaces तयार करू शकाल.
ms: Kenali SwiftUI dari asas dan pelajari pembangunan antaramuka deklaratif Apple secara tersusun. Melalui penerangan yang jelas dan latihan contoh sebenar, anda akan beransur-ansur menguasai susun atur, interaksi dan pengurusan keadaan untuk membina antaramuka aplikasi yang cantik dan berguna.
nb: Bli kjent med SwiftUI fra grunnen av, og lær Apples deklarative UI-utvikling på en systematisk måte. Med tydelige forklaringer og praktiske eksempler vil du gradvis mestre layout, interaksjon og tilstandshåndtering for å bygge flotte og nyttige appgrensesnitt.
nl: Leer SwiftUI vanaf nul en maak systematisch kennis met Apple’s declaratieve UI-ontwikkeling. Met duidelijke uitleg en praktische voorbeelden leer je stap voor stap lay-out, interactie en statusbeheer om mooie en bruikbare app-interfaces te bouwen.
or: ଶୂନ୍ୟରୁ SwiftUI କୁ ଜାଣନ୍ତୁ ଏବଂ Apple ର declarative UI development କୁ ବ୍ୟବସ୍ଥିତ ଭାବେ ଶିଖନ୍ତୁ। ସରଳ ଓ ସ୍ପଷ୍ଟ ବ୍ୟାଖ୍ୟା ସହିତ ପ୍ରାୟୋଗିକ ଉଦାହରଣ ମାଧ୍ୟମରେ ଆପଣ ଧୀରେ ଧୀରେ layout, interaction ଏବଂ state management ରେ ପାରଦର୍ଶୀ ହେବେ ଏବଂ ସୁନ୍ଦର ଓ ପ୍ରୟୋଜନୀୟ app interfaces ତିଆରି କରିପାରିବେ।
pa: SwiftUI ਨੂੰ ਬਿਲਕੁਲ ਸ਼ੁਰੂ ਤੋਂ ਸਮਝੋ ਅਤੇ Apple ਦੇ declarative UI development ਨੂੰ ਵਿਵਸਥਿਤ ਢੰਗ ਨਾਲ ਸਿੱਖੋ। ਸੌਖੀਆਂ ਵਿਆਖਿਆਵਾਂ ਅਤੇ ਅਸਲ ਉਦਾਹਰਨਾਂ ਦੀ ਮਦਦ ਨਾਲ ਤੁਸੀਂ ਹੌਲੀ-ਹੌਲੀ layout, interaction ਅਤੇ state management ਵਿੱਚ ਨਿਪੁੰਨ ਹੋ ਜਾਵੋਗੇ ਅਤੇ ਸੁੰਦਰ ਤੇ ਲਾਭਕਾਰੀ app interfaces ਤਿਆਰ ਕਰ ਸਕੋਗੇ।
pl: Poznaj SwiftUI od podstaw i ucz się systematycznie deklaratywnego tworzenia interfejsów Apple. Dzięki jasnym wyjaśnieniom i praktycznym przykładom stopniowo opanujesz układ, interakcje i zarządzanie stanem, aby tworzyć piękne i użyteczne interfejsy aplikacji.
pt: Conheça o SwiftUI do zero e aprenda de forma sistemática o desenvolvimento declarativo de interfaces da Apple. Com explicações claras e exemplos práticos, você dominará gradualmente layout, interação e gerenciamento de estado para criar interfaces de app bonitas e úteis.
ro: Descoperă SwiftUI de la zero și învață sistematic dezvoltarea declarativă a interfețelor Apple. Prin explicații clare și exemple practice, vei stăpâni treptat layoutul, interacțiunea și gestionarea stării pentru a construi interfețe de aplicații frumoase și utile.
ru: Изучайте SwiftUI с нуля и последовательно осваивайте декларативную разработку интерфейсов Apple. Благодаря понятным объяснениям и практическим примерам вы постепенно овладеете компоновкой, взаимодействием и управлением состоянием, чтобы создавать красивые и полезные интерфейсы приложений.
sk: Spoznajte SwiftUI od nuly a systematicky sa naučte deklaratívny vývoj rozhraní od Apple. Vďaka jasným vysvetleniam a praktickým príkladom si postupne osvojíte rozloženie, interakciu a správu stavu, aby ste mohli vytvárať krásne a užitočné rozhrania aplikácií.
sl: Spoznajte SwiftUI od začetka in se sistematično naučite Applovega deklarativnega razvoja vmesnikov. Z jasnimi razlagami in praktičnimi primeri boste postopoma osvojili postavitev, interakcije in upravljanje stanja ter zgradili lepe in uporabne vmesnike aplikacij.
sv: Lär känna SwiftUI från grunden och lär dig Apples deklarativa gränssnittsutveckling på ett strukturerat sätt. Med tydliga förklaringar och praktiska exempel kommer du steg för steg att behärska layout, interaktion och tillståndshantering för att bygga snygga och användbara appgränssnitt.
ta: SwiftUI-ஐ அடிப்படையிலிருந்து அறிந்து, Apple-ի declarative UI development-ஐ முறையாகக் கற்றுக்கொள்ளுங்கள். எளிய விளக்கங்களும் நடைமுறை உதாரணங்களும் மூலம் layout, interaction மற்றும் state management ஆகியவற்றை படிப்படியாக கற்று, அழகும் பயன்பாடும் கொண்ட app interfaces உருவாக்கலாம்.
te: SwiftUI ను మొదటి నుంచి అర్థం చేసుకుని Apple యొక్క declarative UI development ను వ్యవస్థబద్ధంగా నేర్చుకోండి. సులభమైన వివరణలు మరియు ప్రాయోగిక ఉదాహరణల ద్వారా మీరు క్రమంగా layout, interaction, state management ను నేర్చుకుని అందమైన మరియు ఉపయోగకరమైన app interfaces నిర్మించగలుగుతారు.
th: เริ่มทำความรู้จัก SwiftUI ตั้งแต่พื้นฐาน และเรียนรู้การพัฒนา UI แบบประกาศของ Apple อย่างเป็นระบบ ผ่านคำอธิบายที่เข้าใจง่ายและตัวอย่างใช้งานจริง คุณจะค่อย ๆ เข้าใจเรื่องการจัดวาง การโต้ตอบ และการจัดการสถานะ เพื่อสร้างหน้าตาแอปที่สวยงามและใช้งานได้จริง
tr: SwiftUI’yi sıfırdan tanıyın ve Apple’ın bildirime dayalı arayüz geliştirme yaklaşımını sistemli biçimde öğrenin. Açık anlatımlar ve pratik örneklerle düzen, etkileşim ve durum yönetimini adım adım kavrayarak güzel ve kullanışlı uygulama arayüzleri oluşturabilirsiniz.
uk: Познайомтеся зі SwiftUI з нуля та системно вивчайте декларативну розробку інтерфейсів Apple. Завдяки зрозумілим поясненням і практичним прикладам ви поступово опanuєте компонування, взаємодію та керування станом, щоб створювати красиві й корисні інтерфейси застосунків.
ur: SwiftUI کو صفر سے سمجھیں اور Apple کی declarative UI development کو منظم انداز میں سیکھیں۔ آسان وضاحتوں اور عملی مثالوں کے ذریعے آپ آہستہ آہستہ layout، interaction اور state management میں مہارت حاصل کریں گے اور خوبصورت اور کارآمد app interfaces بنا سکیں گے۔
vi: Làm quen với SwiftUI từ con số 0 và học một cách hệ thống về phát triển giao diện khai báo của Apple. Thông qua phần giải thích dễ hiểu và các ví dụ thực tế, bạn sẽ từng bước nắm vững bố cục, tương tác và quản lý trạng thái để xây dựng giao diện ứng dụng đẹp và hữu ích.
zh_hans: 从零认识 SwiftUI，系统学习苹果声明式界面开发。通过简洁易懂的讲解与实际案例练习，帮助你逐步掌握布局、交互与状态管理，构建精美而实用的应用界面。
zh_hant: 從零認識 SwiftUI，系統學習 Apple 宣告式介面開發。透過簡潔易懂的講解與實際案例練習，幫助你逐步掌握佈局、互動與狀態管理，建構精美而實用的應用介面。

source: Start Learning
ar: ابدأ التعلم
bg: Започнете
bn: শেখা শুরু
ca: Comença
cs: Začít
da: Start læring
de: Jetzt lernen
el: Ξεκινήστε
es: Empezar
fi: Aloita opiskelu
fr: Commencer
gu: શીખવાનું શરૂ કરો
he: התחל ללמוד
hi: सीखना शुरू करें
hr: Počni učiti
hu: Kezdje el
id: Mulai belajar
it: Inizia
ja: 学習を始める
kk: Оқуды бастау
kn: ಕಲಿಕೆ ಆರಂಭಿಸಿ
ko: 학습 시작
lt: Pradėti
ml: പഠനം തുടങ്ങുക
mr: शिकणे सुरू करा
ms: Mula belajar
nb: Start læring
nl: Begin met leren
or: ଶିଖିବା ଆରମ୍ଭ
pa: ਸਿੱਖਣਾ ਸ਼ੁਰੂ ਕਰੋ
pl: Zacznij naukę
pt: Começar
ro: Începe
ru: Начать
sk: Začať
sl: Začni
sv: Börja lära
ta: கற்றலை தொடங்கு
te: నేర్చుకోవడం ప్రారంభించండి
th: เริ่มเรียนรู้
tr: Öğrenmeye başla
uk: Почати
ur: سیکھنا شروع کریں
vi: Bắt đầu học
zh_hans: 开始学习
zh_hant: 開始學習
